namespace Server_ProjectMathHelper_v1._0.Classes
{
    public static class SetDataQuestions
    {
        public static List<Tuple<double, string>> SetWords()
        {
            List<Tuple<double, string>> data = new List<Tuple<double, string>>()
            {
                // Задачи по смежным углам
                new Tuple<double, string>(0.1, "Найдите длину гипотенузы прямоугольного треугольника со сторонами 3 и 4."),
    new Tuple<double, string>(0.1, "Если стороны прямоугольного треугольника равны 5 и 12, найдите длину гипотенузы."),
    new Tuple<double, string>(0.1, "Длины катетов прямоугольного треугольника равны 6 и 8. Какова длина гипотенузы?"),
    new Tuple<double, string>(0.1, "Найдите длину одного из катетов прямоугольного треугольника, если известна длина гипотенузы (5) и другого катета (3)."),
    new Tuple<double, string>(0.1, "В прямоугольном треугольнике длины катетов составляют 7 и 24. Найдите длину гипотенузы."),
    new Tuple<double, string>(0.1, "Если гипотенуза прямоугольного треугольника равна 10, а один из катетов равен 6, найдите длину другого катета."),
    new Tuple<double, string>(0.1, "Найдите длину гипотенузы прямоугольного треугольника, если один катет равен 9, а другой 12."),
    new Tuple<double, string>(0.1, "В прямоугольном треугольнике известны длины гипотенузы и одного катета: 25 и 15. Найдите длину другого катета."),
    new Tuple<double, string>(0.1, "Если в прямоугольном треугольнике гипотенуза равна 13, а один из катетов 5, найдите длину второго катета."),
    new Tuple<double, string>(0.1, "Найдите длину гипотенузы прямоугольного треугольника, если катеты равны 9 и 12."),
    new Tuple<double, string>(0.1, "Если стороны прямоугольного треугольника составляют 8 и 15, найдите длину гипотенузы."),
    new Tuple<double, string>(0.1, "Если гипотенуза прямоугольного треугольника равна 26, а один катет 10, найдите длину второго катета."),
    new Tuple<double, string>(0.1, "Найдите длину гипотенузы прямоугольного треугольника, если катеты равны 15 и 20."),
    new Tuple<double, string>(0.2, "Дан треугольника с углами 60°, 70° и 50°, найдите их сумму."),
    new Tuple<double, string>(0.2, "Углы треугольника составляют 45°, 45° и 90°. Какова сумма этих углов?"),
    new Tuple<double, string>(0.2, "Найдите сумму углов равнобедренного треугольника, если один из углов равен 100°."),
    new Tuple<double, string>(0.2, "Треугольник имеет углы 30°, 60° и 90°. Какова сумма этих углов?"),
    new Tuple<double, string>(0.2, "Если два угла треугольника равны 50° и 70°, найдите сумму всех трех углов."),
    new Tuple<double, string>(0.2, "Найди сумму углов треугольника если два равных угла равны 80"),
    new Tuple<double, string>(0.2, "Чему равен угол в равнобедренном треугольнике,если оин из углов равен 120."),
    new Tuple<double, string>(0.2, "У треугольника углы составляют 80°, 60° и х. Найдите значение угла х."),
    new Tuple<double, string>(0.2, "Треугольник имеет углы 40°, 50° и х. Найдите значение угла х."),
    new Tuple<double, string>(0.3, "Площадь квадрата ABCD равна 36 кв. см. Найдите длину его стороны."),
new Tuple<double, string>(0.3, "Отрезки АВ и CD пересекаются в точке О, которая является серединой каждого из них. Чему равен отрезок BD, если отрезок АС = 10 м."),
new Tuple<double, string>(0.3, "Через середину О отрезка АВ проведена прямая, перпендикулярная прямой АВ. Докажите, что каждая точка Х этой прямой одинаково удалена от точек А и В"),
new Tuple<double, string>(0.3, "Отрезки АВ и CD пересекаются в точке О. Докажите равенство треугольников АСО и DBO, если известно, что угол АСО равен углу DBO и ВО = СО"),
new Tuple<double, string>(0.3, "Докажите равенство треугольников по медиане и углам, на которые медиана разбивает угол треугольника."),
new Tuple<double, string>(0.3, "Докажите равенство треугольников по двум сторонам и медиане, исходящим из одной вершины"),
new Tuple<double, string>(0.3, "Докажите равенство треугольников по стороне, медиане, проведенной к этой стороне, и углам, которые образует с ней медиана"),
new Tuple<double, string>(0.3, "Расскажи три признака равенства треугольников"),

            };

            return data;
        }
    }
}